using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class 這個遊戲 : MonoBehaviour
{
    /*15+1個朋友的故事
     * 
     * 
     * 
     * 朋友媽媽來派對接朋友回家了
     * 
     * 派對舞台中有個大洞, 要幫朋友完成答應的事
     * 
     * 洞中什麼都有
     * 
     * 要是朋友死在洞中, 朋友媽媽會激動的跳洞
     * 
     * 其實大家都被算朋友, 只要出現過都被算朋友
     * 
     * 洞 == 地城
     * 
     * 下去/起來 不同路, 朋友通常比較擅長下去(下去朋友甚至不耗魔), 上來則會被剋屬到爆
     * 下去越深累積資源越好
     * 上去越慢, 越難
     * 
     * 
     * 地城中的朋友可能會被劇情殺(通常是殺主角觸發轉移)
     * 
     * 
     1. 玩家操控的角色被殺時, 兇手則為新的操控角色(這件 事 朋友們 都知道)
     
     2. 角色的記憶與重擔, 是會被繼承的

     3. 最後人死完了, 主角就像個被困在空島上澆花永生不死的園藝匠.
    

    -1. 主角有被欺負殺害的莫可奈何原因
    -2. 主角無法在前幾次就 認知 到轉移的發生
    -3. 同情 的 本質 是 轉移

    a. 主角的個性, 沒有同情他人的 習慣
    b. 主角不喜歡 顧著 人
    c. 大家都說主角應該 得到 自閉症了
     
     
     []場地在派對, 只有晚霞跟黎明能離開
    []石像花園, 收藏了離開的朋友棋子石像

    <>送 朋友離開, 是這個遊戲的核心玩法<><><><><<>>>>>>>>>>>>>>>>>>>>>>>>>><><><><<>>>>>>>>>><<>><<>><<<>>>><>><>

    {一場"主角"是那個倖存者的派對}
     
    
    !舊友恨你
     !送朋友離開
    !出現朋友石像
    !好石像 安全區...上debuff
    !恨石像 能講話, 上debufff



     !敲碎石像 減少血量上限
     

=NPC=
    花園魁偶 - 中空能塞一個成人的玩偶, [常常]是扁的, [每]次都只有 主角 不知道現在又是誰在裡面了...
     大遊覽車 - 千辛萬苦能上去, 後來發現 主角上去也離不開, "至少這次可以陪朋友直到他/她/它/牠/祂 消失..."
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     */


    // Start is called before the first frame update
    void Start()
    {
        
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}
